{
  "reviews": [
    {
      "author": "thorian93",
      "author_details": {
        "name": "",
        "username": "thorian93",
        "avatar_path": null,
        "rating": 6.5
      },
      "content": "Today I enjoyed: Damsel.\r\n\r\nDamsel is a Netflix Original, that was released just a few days ago. Starring a strong cast with Millie Bobby Brown, Robin Wright, Angela Bassett and the voice of Shohreh Aghdashloo it follows the odyssey of Elodie. I am not going to spoil the plot for you, but I bet you can foresee most developments, dear reader.\r\n\r\nOverall I have mixed feelings. The story is nothing new, most elements are well known for this kind of movie. Some decisions of characters (including the dragon) feel dumb, and sometimes our main character gets very lucky, so the rest of the plot can happen. The CGI ranges from poor to pretty good, poor more in the begging, with huge landscapes and castles, but later, when the dragon makes an appearance, it looks pretty decent. But I was watching on a rather small screen and Netflix is punishing me with mediocre quality for some time now. So take my visual rating with a grain of salt. Now one thing I will say about the dragon: It has an interesting spin to it. For one thing, half of the time, we do not really see it and only hear Shohreh Aghdashloo's deep, rasping voice, bringing it to life. And when we actually see the dragon, it has a slight horror touch if you will. It looks like a hybrid between your average majestic and broadly loved dragon and something more dark and slimy. A muskrat comes to mind. I liked that (sort of).\r\n\r\nOne remark towards the title: While it is obviously a play the well known 'Damsel in distress' and obviously Elodie fights instead of needing to be rescued, she screams a lot and actually seems in distress half of the film. Until she suddenly becomes the hero and single-handedly fights the dragon. It is a bit much and hard to believe.\r\n\r\nThis is in all honesty an average movie. It is neither terrible nor great. If you are in the mood for some imagery, gold and jewels, dragons, princesses, and a few swords, then go for it. There are worse ways to spend roughly 109 minutes. But there are also better ways.\r\n\r\n_Originally posted on my blog: https://robingierse.de/blog/tie-damsel._",
      "created_at": "2024-03-09T03:03:52.465Z",
      "id": "65ebd1985bce9e01864653ee",
      "updated_at": "2024-03-09T03:07:54.100Z",
      "url": "https://www.themoviedb.org/review/65ebd1985bce9e01864653ee"
    },
    {
      "author": "Sejian",
      "author_details": {
        "name": "",
        "username": "Sejian",
        "avatar_path": null,
        "rating": 6
      },
      "content": "Damsel suffers from the same issues that plague movies of this kind, and no, I'm not talking about the \"woke agenda\" or \"muh diversity\". I'm talking about bad writing. Too much reverse \"show, don't tell\" and too many contrived scenes and one-liners.\r\n\r\nThe CGI is good, the costumes and set designs are good, the overall plot is good, but the writing falters often.\r\n\r\nI get that this is a PG-13 movie but teenage viewers aren't this dumb. Give them better writing. Maybe if we treat the younger generation like they have some intelligence, they'll start acting like it.\r\n\r\nThe end result is a movie that wastes its star power and the effort of all involved.\r\n\r\nVAGUE SPOILERS AHEAD:\r\n\r\n1. I get they were trying to do foreshadowing with the opening scene, but it ruined the \"reveal\". The birds were a nice thrilling scene that fell flat by us already being shown the antagonist.\r\n2. The \"V\" hallucination was just too silly. Elodie should have found the _evidance_ and had her own organic \"Tis a lie!\" reaction.\r\n3. It would have been nice to see Elodie wield a sword at some point before they left their kingdom, even if it was just her toting one in her introduction scene \"for wolves\" or some excuse. Take some hints from Brave (2012)'s Merida in the future for crying out loud.\r\n4. Sister's reaction to stepmother's concern felt forced.\r\n5. Stepmother's cut should have been a stab and she should have been in worse shape when she found Elodie. That scene also needed some work to make it less unbelievable. Like perhaps have Elodie make it back to the ship and find stepmother badly injured. Time skips are a thing that happens, y'know?\r\n6. Father's reasons could have been better written. Easily they could've had palace guards shadow him to imply he'd been threatened and then redone his rescue attempt. Why? Because he is never shown to be callous to the needs or feelings of his daughters. Their family being threatened would've made more sense than \"well I thought the sacrifice was worth it for the good of 'OUR' people\". Why they had him say \"my\" is anyone's guess.\r\n7. Less stoic one-liners and less stoic \"No! <*thrusts sword into ground*>\" moments. We've seen it numerous times and it's just utterly boring and contrived at this point.",
      "created_at": "2024-03-10T05:49:18.350Z",
      "id": "65ed49debdc34c0163327199",
      "updated_at": "2024-03-19T16:40:46.574Z",
      "url": "https://www.themoviedb.org/review/65ed49debdc34c0163327199"
    },
    {
      "author": "Manuel São Bento",
      "author_details": {
        "name": "Manuel São Bento",
        "username": "msbreviews",
        "avatar_path": null,
        "rating": 6
      },
      "content": "FULL SPOILER-FREE REVIEW @ https://talkingfilms.net/damsel-review-a-generic-yet-immersive-fantasy-flick/\r\n\r\n\"Damsel attempts to deliver a tale of empowerment and adventure within the rich fantasy genre but finds itself entangled in the ropes of predictability and missed opportunities for deeper narrative innovation.\r\n\r\nDespite its shortcomings, the film shines through its technical prowess, from visually stunning effects to immersive world-building, and is anchored by Millie Bobby Brown’s compelling lead performance.\r\n\r\nWhile it may not redefine its genre or leave an indelible mark on the history of cinema, it’s a pleasant home viewing with moments of genuine charm and resilience.\"\r\n\r\nRating: B-",
      "created_at": "2024-03-12T15:08:37.951Z",
      "id": "65f06ff59463180147609d12",
      "updated_at": "2024-03-12T15:08:38.073Z",
      "url": "https://www.themoviedb.org/review/65f06ff59463180147609d12"
    }
  ]
}